{
  "entity_labels": {
    "ACTION": 0,
    "COMPONENT": 1,
    "EXPECTED_EXPR": 2,
    "FAULT_EXPR": 3,
    "FIELD_NAME": 4,
    "INTERFACE": 5,
    "MESSAGE": 6,
    "OBJECT": 7,
    "PARAM_NAME": 8,
    "PARAM_VALUE": 9,
    "SIGNAL": 10,
    "TEST_CONDITION": 11
  },
  "classification_labels": {
    "standard_source": {
      "GB/T 34657.2-2017": 0,
      "GB/T 34658-2025": 1
    },
    "scene_type": {
      "AC": 0,
      "DC": 1
    },
    "system_class": {
      "unknown": 0
    },
    "test_layer": {
      "application_layer": 0,
      "interoperability": 1
    },
    "condition_type": {
      "fault": 0,
      "normal": 1
    },
    "test_type": {
      "negative": 0,
      "positive": 1
    },
    "test_stage": {
      "交流控制导引阶段": 0,
      "交流连接确认阶段": 1,
      "低压辅助上电及充电握手阶段": 2,
      "充电准备就绪阶段": 3,
      "充电参数配置阶段": 4,
      "充电结束或中止阶段": 5,
      "充电阶段": 6,
      "时间同步阶段": 7,
      "直流接口连接确认阶段": 8,
      "直流控制导引阶段": 9,
      "辨识阶段": 10,
      "错误处理阶段": 11
    },
    "fault_type": {
      "CC2信号异常": 0,
      "CC信号异常": 1,
      "CP信号异常": 2,
      "K5状态异常": 3,
      "K6状态异常": 4,
      "None": 5,
      "PE断路": 6,
      "S+S-短路": 7,
      "S+断路": 8,
      "S-断路": 9,
      "SOC异常": 10,
      "低压辅助电源异常": 11,
      "保护接地故障": 12,
      "充电与行驶互锁异常": 13,
      "急停": 14,
      "报文ID错误": 15,
      "报文内容错误": 16,
      "报文周期错误": 17,
      "报文格式错误": 18,
      "报文超时": 19,
      "报文长度错误": 20,
      "报文顺序错误": 21,
      "欠压": 22,
      "电压越界": 23,
      "电子锁异常": 24,
      "电流越界": 25,
      "绝缘故障": 26,
      "车辆接口断开": 27,
      "过压": 28
    }
  },
  "multi_label_labels": {
    "action_intent": {
      "发送报文": 0,
      "故障注入": 1,
      "断开连接": 2,
      "检查响应": 3,
      "模拟边界": 4,
      "等待报文": 5,
      "记录故障": 6,
      "设置参数": 7
    }
  },
  "message_labels": {
    "BCL": 0,
    "BCP": 1,
    "BCS": 2,
    "BEM": 3,
    "BHM": 4,
    "BMT": 5,
    "BMV": 6,
    "BRM": 7,
    "BRO": 8,
    "BSD": 9,
    "BSM": 10,
    "BSP": 11,
    "BST": 12,
    "CCS": 13,
    "CEM": 14,
    "CHM": 15,
    "CML": 16,
    "CRM": 17,
    "CRO": 18,
    "CSD": 19,
    "CST": 20,
    "CTS": 21
  },
  "statistics": {
    "total": 300,
    "entity_label_count": 12,
    "classification": {
      "standard_source": {
        "GB/T 34658-2025": 242,
        "GB/T 34657.2-2017": 58
      },
      "scene_type": {
        "DC": 266,
        "AC": 34
      },
      "system_class": {
        "unknown": 300
      },
      "test_layer": {
        "application_layer": 242,
        "interoperability": 58
      },
      "condition_type": {
        "fault": 255,
        "normal": 45
      },
      "test_type": {
        "negative": 255,
        "positive": 45
      },
      "test_stage": {
        "充电阶段": 72,
        "充电结束或中止阶段": 42,
        "辨识阶段": 30,
        "低压辅助上电及充电握手阶段": 28,
        "交流连接确认阶段": 23,
        "充电参数配置阶段": 20,
        "错误处理阶段": 18,
        "充电准备就绪阶段": 18,
        "直流控制导引阶段": 16,
        "时间同步阶段": 14,
        "交流控制导引阶段": 11,
        "直流接口连接确认阶段": 8
      },
      "fault_type": {
        "报文内容错误": 47,
        "None": 45,
        "报文长度错误": 27,
        "报文ID错误": 27,
        "报文周期错误": 27,
        "报文格式错误": 26,
        "报文顺序错误": 22,
        "报文超时": 22,
        "CC信号异常": 9,
        "电压越界": 8,
        "CP信号异常": 6,
        "电流越界": 4,
        "绝缘故障": 4,
        "欠压": 3,
        "低压辅助电源异常": 3,
        "S-断路": 2,
        "K5状态异常": 2,
        "电子锁异常": 2,
        "S+断路": 2,
        "K6状态异常": 2,
        "SOC异常": 2,
        "急停": 1,
        "过压": 1,
        "CC2信号异常": 1,
        "S+S-短路": 1,
        "车辆接口断开": 1,
        "充电与行驶互锁异常": 1,
        "PE断路": 1,
        "保护接地故障": 1
      }
    },
    "multi_label": {
      "action_intent": {
        "检查响应": 300,
        "故障注入": 250,
        "设置参数": 192,
        "发送报文": 164,
        "等待报文": 74,
        "模拟边界": 24,
        "断开连接": 7,
        "记录故障": 4
      }
    }
  }
}